spec/fixtures/stripe_subscription.json

{
  "id": "sub_9G34zpiKkIsTgw",
  "object": "subscription",
  "customer": "cus_9G34PBYyIObZ4R",
  "application_fee_percent": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "created": 1474788173,
  "current_period_end": 1477380173,
  "current_period_start": 1474788173,
  "discount": null,
  "ended_at": null,
  "livemode": false,
  "metadata": {},
  "plan": {
    "id":"Edison plan",
    "object":"plan",
    "amount":5,
    "created":1468479918,
    "currency":"usd",
    "interval":"month",
    "interval_count":1,
    "livemode":false,
    "metadata":{},
    "name":"Edison plan",
    "statement_descriptor":null,
    "trial_period_days":null
  },
  "quantity": 1,
  "start": 1474788173,
  "status": "active",
  "tax_percent": null,
  "trial_end": null,
  "trial_start": null
}
